# Fisher 插件列表
# 运行 `fisher update` 来安装/更新这些插件

# Fisher 本身
jorgebucaran/fisher

# fzf 集成（对应 zsh 的 fzf-zsh-plugin）
PatrickF1/fzf.fish

# 目录跳转（对应 zsh 的 z 和 autojump）
jethrokuan/z

# 命令完成通知（对应 zsh 的 command-time）
franciscolourenco/done

# 自动配对括号和引号
jorgebucaran/autopair.fish

# 缩写提示（对应 zsh 的 you-should-use）
gazorby/fish-abbreviation-tips

# nvm 集成（对应 zsh 的 zsh-nvm）
jorgebucaran/nvm.fish

# 美观的 prompt 主题（可选，替代 half-life）
IlanCosman/tide@v6

# Git 状态增强
laughedelic/pisces

# Docker 补全增强（可选，Fish 4.0+ 自带 Docker 补全）
# barnybug/docker-fish-completion